
drop table tbl_assess;

drop table tbl_Specialty;

drop table tbl_specialtyOrder;

drop sequence tbl_specialtyOrder_id;

drop sequence tbl_Specialty_id;

drop sequence tbl_assess_id ;

drop sequence travel_user_id ;

drop sequence travel_address_id ;
--创建tbl_Specialty地方特产表

create  table tbl_Specialty(
	
	id number(7),
	
	SpeName varchar2(255) not null,
	
	ProductParamenters varchar2(255)  not null,
	
	FactoryName varchar2(255)  not null,
	
	FactoryPhone varchar2(255)  not null,
	
	StroageMetod varchar2(255)  not null,
	
	FoodAdditives varchar2(255)  not null,
	
	Series varchar2(255)  not null,
	
	Weight varchar2(255)  not null,
	
	rank varchar2(255)  not null,
	
	ProductDate Date  not null,
	
	ProductCode varchar2(255)  not null,
	
	FactoryAddress varchar2(255)  not null,
	
	BurdenSheet varchar2(255)  not null,
	
	ExpirationDate varchar2(255)  not null,
	
	Paching varchar2(255)  not null,
	
	BarCode varchar2(255)  not null,
	
	Organism varchar2(255)  not null,
	
	Origin varchar2(255)  not null,
	
	PreferentialPrice number(8,2)  not null,
	
	Distribution varchar2(255)  not null,
	
	CourierFees number(8,2)  not null,
	
	MonthlySales varchar2(255) not null,
	
	Evaluation varchar2(255)  not null,
	
	Introduction varchar2(255)  not null,
	
	Images varchar2(255)  not null,
	
	ShopPrice number(8,2)  not null,
	
	numberNo varchar2(255)  not null,
	
	primary key(id)
);

create sequence tbl_Specialty_id start with 1;

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'高油鸭蛋','650117020039','扬州高油鸭蛋有限公司加工厂','13838438','置于阴凉干燥处 ',
'无','高油鸭蛋特级500g 一捆','500g','特级',SYSDATE,'GB/T5835','扬州105号367院内房屋',
'鸭蛋','180天','袋装','650117020039','否','1',55.00,'江苏 苏州',
5.00,'3000捆','4.5分','油多，下饭菜','高油鸭蛋.jpg',179.00,'江苏 苏州');


insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'阳澄湖大闸蟹','5867020039','阳澄湖大闸蟹有限公司加工厂','54638438','置于阴凉干燥处 ',
'无','阳澄湖大闸蟹4个 一捆','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'大闸蟹','180天','袋装','650117020039','否','1',75.00,'江苏 苏州',
6.00,'9000捆','9.5分','个大，新鲜','阳澄湖大闸蟹.jpg',45.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'麦芽糖','3457020039','江苏麦芽糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','麦芽糖 一袋','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'小麦','180天','袋装','650117020039','否','1',82.00,'江苏 苏州',
3.00,'9000袋','7.5分','味道香甜','麦芽糖.jpg',220.00,'江苏 苏州');

-------------
insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'八义集豆腐乳','3457020039','江苏八义集豆腐乳有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','豆腐乳 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'佬豆腐','180天','盒装','650117020039','否','1',15.00,'江苏 南京',
8.00,'7000袋','5.5分','飘香四溢 香辣可口','八义集豆腐乳.jpg',136.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'江苏淮饺','3457020039','江苏淮饺有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','江苏淮饺 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'小麦，猪肉','180天','盒装','650117020039','否','2',65.00,'江苏 南京',
8.00,'7000袋','5.5分','飘香四溢 垂涎三尺','江苏淮饺.jpg',150.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'江苏小笼包','3457020039','江苏小笼包有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','江苏小笼包 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'小麦，猪肉','180天','盒装','650117020039','否','2',35.00,'江苏 南京',
9.00,'4000袋','5.5分','飘香四溢 晶莹剔透','江苏小笼包.jpg',410.00,'江苏 南京');




insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'毛脸凉粉','3457020039','江苏毛脸凉粉有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','毛脸凉粉 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'小麦，凉粉','180天','盒装','650117020039','否','2',58.00,'江苏 连云港',
8.00,'4000袋','5.5分','飘香四溢 旷世绝辣','连云港-毛脸凉粉.jpg',100.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'石梁湖葡萄','3457020039','江苏石梁湖葡萄有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','石梁湖葡萄 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'连云港葡萄','180天','盒装','650117020039','否','2',35.00,'江苏 连云港',
8.00,'4000袋','7.2分','飘香四溢 新鲜','连云港特产-石梁湖葡萄.jpg',459.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'南京樱桃鸭','3457020039','江苏南京樱桃鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','南京樱桃鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','3',95.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','南京樱桃鸭.jpg',456.00,'江苏 南京');


insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'南通门山羊肉','3457020039','江苏南通门山羊肉有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','南通门山羊肉 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'羊肉','180天','盒装','650117020039','否','3',795.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','南通门山羊肉.jpg',105.00,'江苏 南京');


insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','3',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','3',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','4',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','4',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');










insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'毛脸凉粉','3457020039','江苏毛脸凉粉有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','毛脸凉粉 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'小麦，凉粉','180天','盒装','650117020039','否','0',58.00,'江苏 连云港',
8.00,'4000袋','5.5分','飘香四溢 旷世绝辣','连云港-毛脸凉粉.jpg',100.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'石梁湖葡萄','3457020039','江苏石梁湖葡萄有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','石梁湖葡萄 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'连云港葡萄','180天','盒装','650117020039','否','0',35.00,'江苏 连云港',
8.00,'4000袋','7.2分','飘香四溢 新鲜','连云港特产-石梁湖葡萄.jpg',459.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'南京樱桃鸭','3457020039','江苏南京樱桃鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','南京樱桃鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','0',95.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','南京樱桃鸭.jpg',456.00,'江苏 南京');


insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'南通门山羊肉','3457020039','江苏南通门山羊肉有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','南通门山羊肉 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'羊肉','180天','盒装','650117020039','否','0',795.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','南通门山羊肉.jpg',105.00,'江苏 南京');


insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','6',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','7',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','5',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','8',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');


insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'南通门山羊肉','3457020039','江苏南通门山羊肉有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','南通门山羊肉 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'羊肉','180天','盒装','650117020039','否','9',795.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','南通门山羊肉.jpg',105.00,'江苏 南京');


insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','10',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','11',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','5',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','12',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');






insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','13',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','14',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','15',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','16',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');









insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','17',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','18',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','19',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','20',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');











insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','21',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','22',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','23',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','24',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');




insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','25',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','26',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','27',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','28',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');






insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','29',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','30',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','31',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','32',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');



insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','33',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','34',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','35',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','36',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');



insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','37',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','38',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','39',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','40',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');




insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'苏州白鱼','3457020039','江苏苏州白鱼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','苏州白鱼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'苏州白鱼','180天','盒装','650117020039','否','40',135.00,'江苏 苏州',
8.00,'4000袋','7.2分','飘香四溢 新鲜','苏州白鱼.jpg',300.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'泰兴黄桥烧饼','3457020039','江苏泰兴黄桥烧饼有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','泰兴黄桥烧饼 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'面粉，猪肉','180天','盒装','650117020039','否','41',35.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','泰兴黄桥烧饼.jpg',567.00,'江苏 苏州');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'盐水鸭','3457020039','江苏南京盐水鸭有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','盐水鸭 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'鸭','180天','盒装','650117020039','否','41',34.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','盐水鸭.jpg',230.00,'江苏 南京');

insert  into tbl_Specialty values(tbl_Specialty_id.nextval,'粽子糖','3457020039','江苏粽子糖有限公司加工厂','8638438','置于阴凉干燥处 ',
'无','粽子糖 一盒','1000g','特级',SYSDATE,'GB/T5835','苏州105号367院内房屋',
'糖浆','180天','盒装','650117020039','否','39',24.00,'江苏 南京',
8.00,'4000袋','7.2分','飘香四溢 新鲜','粽子糖.jpg',235.00,'江苏 南京');
--创建tbl_specialtyOrder地方特产订单表
create TABLE tbl_specialtyOrder(
	id  number(8) not null,
	speName varchar2(255) ,
	specialtyOrderId number(16) ,
	radio varchar2(255) ,
	PreferentialPrice number(8,2) ,
	integral number(8) ,
	quantity number(8) ,
	preferential  number(8,2) ,
	toal number(8,2) ,
	state  varchar2(255) ,
	NopayOrderDate Date,
	user_id  number(8) ,
	Specialty_id number(8) ,
	primary key(id)
);

create sequence tbl_specialtyOrder_id start with 1;
create sequence travel_user_id start with 1;
create sequence travel_address_id start with 1;

--地方特产订单评论表

create  table tbl_assess(
	 
	id   number(8),
	
	levell varchar2(255),
	
	content varchar2(255),
	
	user_id  number(8),
	
	specialty_id number(8),
	
	
	primary key(id)

);

create sequence tbl_assess_id start with 1;



create sequence travel_sights_orders_id start with 1;
create sequence travel_sights_autoid_id start with 1;
create sequence travel_sights_id start with 1;


create table travel_city(
  id number(8),
  
  citynum  varchar2(255),
  
  cityname  varchar2(255)
  
  primary  key (id)


);


create sequence travel_city_id start with 1;




